Tekla Open API Reference for Tekla Structures 2025
IEvents Methods
The IEvents type exposes the following members.
Methods
Name | Description
OnClipPlaneChanged
 Called when user inserts, updates or deletes a clip plane.
OnHiddenObjectsChanged
 Called when objects are set to hidden or view is redrawn
OnInterrupted
 Called when user interrupts.
OnModelSaveInfo
 Called when model is saved.
OnTemporaryStatesChanged
 Called when the temporary states are changed.
OnUndoClicked
 Called when user clicks undo.
OnViewClosed
 Called when a view is closed.
Register
 Registers the instance to listen to the specified events. More event delegates should not be added without calling UnRegister first.
UnRegister
 Unregisters the instance from listening to events.
Top
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace